Tekla Open API Reference for Tekla Structures 2025
RebarCranking.CrankingTypeEnum Enumeration
 The cranking type.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum CrankingTypeEnum
Public Enumeration CrankingTypeEnum
Members
Member name | Value | Description
CUSTOM_CRANKING | 0 |  Custom cranking.
STANDARD_CRANKING | 1 |  Standard cranking.
See Also
Reference
Tekla.Structures.Model Namespace